Repository: horizon-eda/horizon-docs-cz
Catalog: locale/*/LC_MESSAGES/create-board.po
Languages: cs

source: Create a Board
cs: Vytvořte desku

source: Open the board editor from the Project manager.
cs: Otevřete editor desky z hlavní nabídky projektu.

source: Draw a Board Outline
cs: Nakreslete obrys desky

source: Draw a outline by first selecting the "Outline" Layer in the Layers Panel and then selecting the "Draw polygon rectangle" Tool by typing :kbd:`d Y` (or use the Spacebar menu):
cs: Nakreslete obrys desky tak, že nejprve vyberete hladinu "Outline" v panelu hladin a poté vyberte příkaz "Draw polygon rectangle" pomocí stisku kláves :kbd:`d Y` (nebo použijte nabídku mezerníku):

source: Place the Packages
cs: Umístěte pouzdra součástek

source: Place packages on the board using by typing :kbd:`p p` (this time it stands for "Place Package"). If you still have the Schematic Editor open you can also select a Symbol and use the "Place on Board" Tool by clicking it's button in the top bar.
cs: Umístěte pouzdra na desku pomocí stisku kláves :kbd:`p p` (tentokrát to znamená "Place Package" (umísti pouzdro)). Pokud stále máte otevřen editor schemat můžete také vybrat Symbol a použít příkaz "Place on Board" klepnutím na tlačítko v horním panelu.

source: If you select Parts in the Schematic Editor they will also be highlighted in the Board Editor. If you change something in the Schematic Editor bring the changes from the schematic to the board, by saving the schematic and clicking 'reload netlist' in the board editor.
cs: Pokud vyberete součástky v editoru schémat, budou také zvýrazněny. v Editoru desky. Pokud změníte něco ve editoru schemat přeneste změny ze schématu na desku uložením schematu a kliknutím na 'reload netlist' v editoru desky.

source: If you want to place a part on the bottom of the board, press :kbd:`e` to flip it to the bottom side. If you are working a lot on the bottom you can use the "View bottom" tool to flip the whole board around.
cs: Pokud chcete umístit součástku na spodní část desky, stiskněte :kbd:`e` pro přemístění na spodní stranu. Pokud hodně pracujete na spodní straně můžete použít nástroj "View bottom" k převrácení celé desky.

source: Add Planes
cs: Přidejte vyplněné oblasti

source: If you want to use a Ground Plane now would be a good time to add it:
cs: Pokud nyní chcete vyplnit zemní plochu, je správný čas ji přidat:

source: Select the layer you want to have the plane on (Top- or Bottom-Copper)
cs: Vyberte hladinu, na které chcete mít rovinu (Top- nebo Bottom-Copper)

source: Draw a polygon rectangle by typing :kbd:`d Y`
cs: Nakreslete polygon stiskem kláves :kbd:`d Y`

source: Right-Click one of the Edges of the newly added polygon and select "Add Plane"
cs: Klikněte pravým tlačítkem na jednu z hran nově přidaného polygonu a vyberte "Add Plane"

source: In the Window that pops up select the GND net (if it is not there you didn't add the power net in the Schematic)
cs: V okně, které se zobrazí, vyberte spoj GND (pokud tam není a nepřidal jste silový spoj do schématu)

source: If the solid filled color of the plane annoys you, you can switch the display style to something else by clicking onto the colored square left of the layer:
cs: Pokud vás obtěžuje plná barva spoje, můžete přepnout na jiný styl zobrazení kliknutím na barevný čtvereček nalevo od hladiny:

source: Route the Nets
cs: Umístěte spoje

source: To route tracks between the parts you connected in the Schematic, type :kbd:`x` and drag from any pin that starts an airwire:
cs: Chcete-li trasovat spoje mezi součástkami, které jste propojili ve schématu, zadejte :kbd:`x` a přetažením myší z libovolného vývodu zahajte příkaz spoj:

source: The track will always be routed on the layer you have selected, you can quickly select the Top Copper Layer by pressing :kbd:`1` and the Bottom Copper Layer by pressing :kbd:`2`.
cs: Trasa bude vždy směrována na vybrané vrstvě, můžete rychle vybrat horní vrstvu mědi stisknutím :kbd:`1` a dolní vrstvu mědi stisknutím :kbd:`2`.

source: If you want to change sides in the middle of a track you can place a via by pressing :kbd:`v` and then the number of the layer you want to continue.
cs: Pokud chcete změnit stranu během umísťování spoje, můžete umístit průchod. stisknutím klávesy :kbd:`v` a potom číslo vrstvy na které chcete pokračovat.

source: Once you are done, check out the 3D view of your part, and export Gerbers using the menu point "Fabrication Output" in the application menu.
cs: Až budete hotovi, podívejte se na 3D pohled vaší desky a exportujte ve formátu Gerber pomocí nabídky "Fabrication Output" v menu aplikace.

source: Next: :doc:`Look at a Example Project <example-project>`
cs: Dále: :doc:`Podívejte se na příklad projektu <example-project>`
