Repository: horizon-eda/horizon-docs-cz
Catalog: locale/*/LC_MESSAGES/drawing.po
Languages: cs

source: Drawing
cs: Kreslení

source: The different Editors in Horizon EDA share a set of different Drawing tools. Here you can see the ones available in the Board Editor:
cs: Různé editory v Horizon EDA sdílejí sadu různých příkazů pro kreslení Zde vidíte ty dostupné v Editoru desky:

source: The drawing tools are mainly split in three categories:
cs: Kreslicí nástroje jsou rozděleny do tří hlavních kategorií:

source: lines
cs: čáry

source: polygons
cs: mnohoúhelníky

source: special (like draw track, draw dimension etc.)
cs: speciální (jako stopa, kóta atp.)

source: Lines are usually used for everything visual (e.g. Silkscreens) while polygones are used for all things where it matters that the thing you draw results in a closed shape (pads, board outlines, package assembly and courtyard layers, etc.)
cs: Čáry se obvykle používají pro vše vizuální (např. Popisky), zatímco polygony se používají pro všechny objekty, u kterých záleží, aby byl výsledek nakreslen v uzavřeném tvaru (Pájecí místa, obrysy desky, obrys pouzdra a obrys minimálního odsazení atd.)

source: Draw Line
cs: Kreslení čáry

source: To draw a line simply select the "Draw line" Action in the spacebar menu or type the key sequence :kbd:`d l` (think: "draw line") – once you click anywhere, you start the first point of the line right at the place where your manipulator was. You might notice that the point snaps to the grid. If you want a finer grid hold the :kbd:`Alt` key down while placing points. Left mouse button places more and more points, while the right mouse button (or pressing :kbd:`Esc`) will finish the lines.
cs: Chcete-li nakreslit čáru, jednoduše vyberte příkaz "Draw line" z mezerníkového menu nebo zadejte posloupnost kláves :kbd:`d l` (myšleno: "draw line") - jednou kliknete kamkoli, začnete prvním bodem čáry přímo na místě, kde byl váš kursor. Možná si všimnete, že se bod zachytil do rastru mřížky. Pokud chcete jemnější mřížku, podržte klávesu :kbd:`Alt`, během umísťování bodů. Levým tlačítkem myši umísťujete další body, zatímco pravé tlačítko myši (nebo stisknutí klávesy :kbd:`Esc`) dokončí čáru.

source: You might also have noticed the Action Bar at the left bottom of the editor window:
cs: Možná jste si také všimli lišty příkazů v levé dolní části okna editoru:

source: The Action bar will show additional keys you can press to change the behaviour of the tool. In this case you could press :kbd:`w` to change the width of the stroke or :kbd:`/` to restrict the movment of the manipulator to one direction.
cs: V panelu příkazů se zobrazí další klávesy, které můžete stisknout pro změnu chování příkazu. V tomto případě můžete stisknout klávesu :kbd:`w` pro změnu šířky spoje nebo klávesu :kbd:`/` pro omezení pohybu kursoru jedním směrem.

source: Draw Line Rectangle
cs: Kreslení obdélníka

source: To save your time, there is also a "Draw line rectangle" Action, which can also be invoked by typing :kbd:`d L`. Per default you first set the rectangles center point and than one of the corner points. By pressing :kbd:`c` you can change this behaviour and set two diagonally opposed corner points instead.
cs: Abyste ušetřili čas, je zde také příkaz "Draw line rectangle", který lze také vyvolat stiskem kláves :kbd:`d L`. Ve výchozím nastavení se nejprve zadává středový bod obdélníku a dále jeden z rohových bodů. Stisknutím :kbd:`c` můžete toto chování změnit a místo toho zadávat dva diagonálně protilehlé

source: Draw Arc
cs: Kreslení oblouku

source: The "Draw arc" tool is straightforward it draws line arcs by setting three points (in this order): start point, end point and the center point. You can also use the key sequence :kbd:`d a` to start the tool. If you want your arc to flip direction, press :kbd:`e` before putting down the center point.
cs: Nástroj "Draw arc" je jednoduchý, nakreslí čárový oblouk pomocí předvolby tři body (v tomto pořadí): počáteční bod, koncový bod a střed. Pro spuštění příkazu můžete také použít posloupnost kláves :kbd:`d a`. Pokud chcete, aby se oblouk otočil, stiskněte klávesu :kbd:`e` před kliknutím na středový bod.

source: Draw Polygon
cs: Kreslení mnohoúhelníku (polygonu)

source: When drawing polygons with :kbd:`d y` you can set a series of points by clicking, until you either press :kbd:`Esc` or use the right mouse button. You can make the next edge of the polygon an arc by pressing :kbd:`a`. Just like with the "Draw Arc" tool set the endpoint first and the center point after. Before setting the center point you can flip the arc direction with :kbd:`e` and finally you set the end point of the arc.
cs: Při kreslení polygonů pomocí :kbd:`d y` můžete přidávat několik bodů klikáním, dokud nestisknete klávesu :kbd:`Esc` nebo použijete pravé tlačítko myši Součástí polygonu může být také oblouk. Stisknutím klávesy :kbd:`a` Stejně jako u příkazu "Draw Arc" nastavte nejprve koncový bod a potom středový bod. Před nastavením středového bodu můžete oblouku převrátit směr pomocí klávesy :kbd:`e` a nakonec kliknete na koncový bod oblouku.

source: Draw Polygon Rectangle
cs: Kreslení obdélníka

source: Similar to the "Draw line rectangle" Tool there is a "Draw polygon rectangle" tool. Invoke it by typing :kbd:`d Y`. Just like with the according line Tool you can switch between the different draw modes (Center/Corner) by pressing :kbd:`c`.
cs: Podobně jako příkaz "Draw line rectangle" je zde příkaz "Draw polygon rectangle". Vyvolejte ho zadáním klávesy :kbd:`d Y`. Stejně jako u příkazu čára můžete přepínat mezi různými režimy kreslení (Střed/roh) stisknutím klávesy :kbd:`c`.

source: There are some differences though: you can set a corner radius by pressing :kbd:`r` and entering a value and you can choose a decoration by pressing :kbd:`d`. These decorations are used to mark the pin 1 on a Package's assembly layer. You can cycle through different decoration positions by pressing :kbd:`p` and set the size of the decoration by pressing :kbd:`s` and entering a value.
cs: Jsou zde však některé rozdíly: poloměr rohu můžete nastavit pomocí stisknutí :kbd:`r` a zadáním hodnoty si můžete vybrat prvek podle stisku klávesy :kbd:`d`. Tyto prvky se používají k označení vývodu 1 na pouzdře součástky v hladině obrysu součástky. Můžete procházet různými prvky. stiskem klávesy :kbd:`p` a nastavte velikost prvku pomocí stisknutí klávesy :kbd:`s` a zadání hodnoty.

source: Draw Polygon Circle
cs: Kreslení Kruhu

source: For ease of use there is also a "Draw polygon circle" Tool. With the first click you set the circles center point and by setting the second point you set the radius. You can also enter a radius by pressing :kbd:`r` and entering a value.
cs: Pro snadné používání existuje také příkaz "Draw polygon circle". Nejprve kliknete, na střed kruhu a druhým bodem zadáte poloměr. Poloměr můžete také zadat stisknutím klávesy :kbd:`r` a zadání hodnoty.

source: Draw Dimension
cs: Kreslení kóty

source: Sometimes it can be useful to add dimension information to certain parts. You can do so by using the "Draw dimension" ActToolion. Start it by typing :kbd:`d d`, selecting the first and the second point and dragging it out. If the numeric value is on the wrong side, you can fix it by selecting the dimension and flipping it with the :kbd:`e` key.
cs: Někdy může být užitečné přidat informace o rozměrech některých součástí. Můžete to udělat pomocí příkazu "Draw dimension". Spustíte ho pomocí stisku kláves :kbd:`d d`, výběrem prvního a druhého bodu a přetažením. Pokud je číselná hodnota na nesprávné straně, můžete ji opravit pomocí výběru kóty a její převrácení klávesou :kbd:`e`.

source: Dimensions can also be set to specified length by selecting the end that's supposed to move and activating the "Enter Datum" tool (press Enter). You can then snap other items to the end points of the dimension.
cs: Rozměry lze také nastavit na potřebnou délku výběrem konce a z nabídky aktivovat příkaz "Enter Datum" (stiskněte Enter). Potom můžete přichytit další objekty ke koncovým bodům kóty.

source: Next: :doc:`Selection<selection>`
cs: Dále: :doc:`Vybírání<selection>`
