Repository: horizon-eda/horizon-docs-cz
Catalog: locale/*/LC_MESSAGES/entries.po
Languages: cs

source: Numeric Entries
cs: Zadávání numerických hodnot

source: All numeric entries in horizon support basic two-operand math as well as some other goodies.
cs: Všechny zadávací numerická pole v horizontu podporují základní matematiku se dvěma operandy a také některé další operace.

source: They look like these:
cs: Pole vypadají takto:

source: Both point and comma are recognized as a decimal separator regardless of locale settings. By default all numbers are treated as millimeters. Suffixing a number with an ``i`` or ``in`` will treat it as inches. Use ``mi`` or ``mil`` to convert from thous.
cs: Tečka i čárka jsou rozpoznány jako desetinný oddělovač bez ohledu na nastavení národního prostředí. Ve výchozím nastavení jsou všechna čísla považována za milimetry. Přípona čísla s ``i`` nebo ``in`` bude považována za palce. Použijte ``mi`` nebo ``mil`` pro převod z tisícin.

source: Additionally, two-operand infix math is supported, so you can to this:
cs: Navíc je podporována matematika se dvěma fixními operandy, takže můžete:

source: Addition: ``1+2``
cs: Sčítat: ``1+2``

source: Subtraction: ``1-2``
cs: Odčítat: ``1-2``

source: Multiplication: ``3*2``
cs: Násobit: ``3*2``

source: Division: ``3/2``
cs: Dělit: ``3/2``

source: Average :math:`\frac{ a+b }{2}`: ``3|2``
cs: Průměrovat :math:`\frac{ a+b }{2}`: ``3|2``

source: Adding mm and inch: ``1in+2mm``
cs: Sčítat milimetry a palce: ``1in+2mm``
