Repository: horizon-eda/horizon-docs-cz
Catalog: locale/*/LC_MESSAGES/installation.po
Languages: cs

source: Installation
cs: Instalace

source: So you wanna give horizon a test drive? Great! Here's how.
cs: Takže jste se rozhodli vyzkoušet Horizon-EDA? Skvěle! Zde je návod.

source: Stable release
cs: Stabilní verze

source: A known-good snapshot from ongoing development.
cs: Poslední vývojová verze.

source: Windows
cs: Operační systém Windows

source: Download and run the MSI installer from `GitHub releases <https://github.com/horizon-eda/horizon/releases>`_.
cs: Stáhněte a spusťte instalační program MSI z `GitHub release <https://github.com/horizon-eda/horizont/release>`_.

source: Get the latest stable release from `Flathub <https://flathub.org/apps/details/org.horizon_eda.HorizonEDA>`_.
cs: Získejte nejnovější stabilní verzi z `Flathub <https://flathub.org/apps/details/org.horizon_eda.HorizonEDA>`_.

source: If you want to compile it yourself, download the source tarball from `GitHub releases <https://github.com/horizon-eda/horizon/releases>`_ and follow the instructions in :doc:`build-linux`.
cs: Pokud si chcete zkompilovat program sami, stáhněte si zdrojový tarball z `GitHub <https://github.com/horizon-eda/horizon/releases>`_ a postupujte podle pokynů v :doc:`build-linux`.

source: For Arch Linux, there's an `AUR package <https://aur.archlinux.org/packages/horizon-eda>`_.
cs: Pro Arch Linux existuje `AUR instalační balíček <https://aur.archlinux.org/packages/horizont-eda>`_.

source: Keep in mind that binary packages provided by your distribution might be out of date.
cs: Mějte na paměti, že binární balíčky poskytované vaší distribucí mohou být zastaralé.

source: Development version
cs: Vývojová verze

source: Usually works, but might break occasionally, so use at your own risk. Recommended if you want to get the latest in features and bug fixes.
cs: Obvykle funguje, ale občas se může seknout, takže ji používejte jen na vlastní nebezpečí. Doporučeno, pokud chcete získat nejnovější funkce a opravy chyb.

source: Grab the latest build from `AppVeyor CI <https://ci.appveyor.com/project/carrotIndustries/horizon/build/artifacts>`_ and unzip it somewhere. Note that these are 64bit binaries. In case a build is still running or someone broke the build, you can download past builds from `the build history <https://ci.appveyor.com/project/carrotIndustries/horizon/history>`_ (click on artifacts to get the zip)
cs: Stáhnete nejnovější komprimovaný přeložený binární soubor z adresy `AppVeyor CI <https://ci.appveyor.com/project/carrotIndustries/horizon/build/artifacts>`_ a někam ho rozbalte. Pamatujte, že se jedná o 64bitové binární soubory. V případě, že překlad dosud probíhá nebo ho někdo přerušil, si můžete stáhnout předešlé verze z `the build history <https://ci.appveyor.com/project/carrotIndustries/horizon/history>`_ (kliknutím na odkaz stáhnete soubor ve formátu zip)

source: Clone the repository and see :doc:`build-linux` for instructions on how to build horizon on linux.
cs: Klonujte program z úložiště a podívejte se na :doc:`build-linux`, kde najdete pokyny, jak sestavit Horizon na linuxu.

source: Next: :doc:`Setup a pool <pool-setup>`
cs: Dále: :doc:`Nastavení fondu knihoven <pool-setup>`
