Repository: horizon-eda/horizon-docs-cz
Catalog: locale/*/LC_MESSAGES/move.po
Languages: cs

source: Moving and the interactive manipulator
cs: Posouvání a manipulační značky

source: Move with Mouse
cs: Posouvání myší

source: You can move parts and nets by selecting them and typing :kbd:`m`, press :kbd:`Alt` to move on a fine grid. The movment of the selected object has its origin (or pivot) point right at the spot where the interactive manipulator was, when you started the move tool.
cs: Součástky a spoje můžete přesouvat jejich výběrem a stiskem klávesy :kbd:`m`, současným stiskem klávesy :kbd:`Alt` pro pohyb po jemné mřížce. Pohyb vybraného objektu má jeho počáteční (nebo otočný) bod přímo v místě, kde je manipulační značka, když jste spustili příkaz pro přesun.

source: This can be used to our advantage, because it allows us to move objects that have been placed on a finer grid without snapping them back to the coarse grid.
cs: To lze s výhodou využít, protože nám to umožňuje pohybovat objekty.které byly umístěny na jemnější mřížce, aniž by se přichytily zpět khrubé mřížce.

source: Move with Keyboard
cs: Posouvání klávesnicí

source: By using the :kbd:`←/↑/↓/→` arrow keys you can move the selected object one grid step into the desired direction. If you press :kbd:`Alt` at the same time you will move the part on the fine grid (1/10 of the original grid). Because this is also a tool, you can cancel it by pressing :kbd:`Esc` and finish it by pressing :kbd:`Enter` or clicking onto a empty spot.
cs: Pomocí kláves se šipkami :kbd:`←/↑/↓/→` můžete vybraný objekt přesunout o jeden krok mřížky požadovaným směrem. Pokud současně stisknete :kbd:`Alt` přesunete díl po jemné mřížce (1/10 původní mřížky). Protože je to také příkaz, můžete jej zrušit stisknutím :kbd:`Esc` a dokončit jej stisknutím :kbd:`Enter` nebo kliknutím na prázdný bod.

source: Move Exactly
cs: Přesné posunování

source: The "Move exactly" tool allows you to enter numbers to move an object by an exact number of units (e.g. 1 mm) into the desired direction. You can start the tool by pressing :kbd:`M`
cs: Příkaz "Move exactly" umožňuje zadat přesný rozměr pro přesun objektu (např. 1 mm) požadovaným směrem. Příkaz můžete spustit stisknutím :kbd:`M`

source: Flip
cs: Převracení stran

source: You can flip symbols or parts by pressing :kbd:`e`. If you use this on the board editor, it is the same as flipping the part onto the other side
cs: Symboly nebo součástky můžete převrátit stisknutím klávesy :kbd:`e`. Použijete-li to v editoru desky, je to stejné jako převrácení součástky na druhou stranu desky (spodní/horní)

source: Rotate
cs: Otáčení

source: You can rotate objects by 90° if you press :kbd:`r` or select the "rotate" tool. If you like to rotate a object by something else (e.g. 30° or 45°) use the "Rotate arbitrary" tool. The pivot point of the rotation is always the location of the interactive manipulator, so make sure it is at the right spot
cs: Objekty můžete otáčet o 90 °, pokud stisknete :kbd:`r` nebo vyberete příkaz "rotate" Pokud chcete objekt otočit o jinou hodnotu (např. 30 ° nebo 45 °) použijte příkaz "Rotate arbitrary" . Otočný bod rotace je vždy umístění manipulační značky, takže se ujistěte, že je na správném místě
