Repository: horizon-eda/horizon-docs-cz
Catalog: locale/*/LC_MESSAGES/python.po
Languages: cs

source: Python module
cs: Modul python

source: Parts of Horzion EDA are available as a python module for use in scripts.
cs: Některé funkce Horzion EDA jsou k dispozici v modulu Python pro použití ve skriptech.

source: Installation
cs: instalace

source: The python module isn't included in the :code:`all` target. To build it, run :code:`make build/horizon.so`. This requires the python 3 headers to be installed. You can then place it in python's :code:`sys.path` and import it using :code:`import horizon`.
cs: Modul python není zahrnut v překladu pomocí :code:`build all`. Chcete-li jej sestavit, spusťte překlad pomocí :code:`make build/horizon.so`. To vyžaduje mít instalovány hlavičkové soubory Pythonu veze 3. Potom můžete použít v Pythonu :code:`sys.path` a importovat pomocí :code:`import horizon`.

source: Usage
cs: Použití

source: To further adjust the export settings, have a look at the dicts returned by the :code:`get_*_export_settings` methods.
cs: Chcete-li dále upravit nastavení exportu, podívejte se na vrácené příkazy. pomocí metody :code:`get_*_export_settings`.

source: 3D rendering usage
cs: Použití 3D vykreslování

source: use :code:`brd.export_3d(1920, 1080)` or similar to get an Image3DExporter object
cs: Použijte :code:`brd.export_3d(1920, 1080)` nebo podobně pro vytvořeníImage3DExporter objektu

source: Render to png image
cs: Vykreslit obrázek formátu png

source: Render to pycairo surface
cs: Vykreslit plochu formátu pycairo

source: Loads 3D models if available
cs: Načte 3D modely pokud jsou k dispozici

source: Resets view to top side
cs: Obnoví pohled na horní stranu
