Repository: horizon-eda/horizon-docs-cz
Catalog: locale/*/LC_MESSAGES/selection.po
Languages: cs

source: Selection
cs: Vybírání

source: Selection throughout the Editors of Horizon EDA is very straightforward and there are no surprises here. No matter how basic it seems, the different modes and filters could save you quite some time.
cs: Výběr v editorech Horizontu EDA je velmi jednoduchý a nejsou zde žádná překvapení. Nezáleží na tom, jak jednoduše to vypadá, různé režimy a filtry vám mohou ušetřit dost času.

source: Basics
cs: Základy

source: Initially, the "hover select" mode is active. It simply selects the smallest object under the cursor. Leftclick or drag with the clicked button to select objects permanently. Hit :kbd:`Esc` or click into a blank space for returning to hover select mode.
cs: Zpočátku je aktivní režim letmého výběru "hover select". Jednoduše vybere nejmenší objekt pod kurzorem. Levým tlačítkem myši nebo kliknutím a přetažením pro trvalé vybrání objektů. Stiskněte :kbd:`Esc` nebo klikněte na prázdné místo pro návrat do režimu letmého výběru.

source: If you want to select multiple things by clicking keep Hit :kbd:`Ctrl` pressed while you click on things – this also works to deselect things you accidentally selected while dragging a selection box.
cs: Pokud chcete vybrat více objektů během klikání držte stisknutou klávesu :kbd:`Ctrl`. Funguje to také pro zrušení výběru objektů, které jste omylem vybrali při přetahování výběrového pole.

source: Selection Mode
cs: Módy výběru

source: You can change how dragging the left mouse button behaves in the lower left corner of the editor window. Available are three different modes (Box, Lasso, Paint) with four different selection characteristics (Auto, Include Origin, Touch Box, Include Box).
cs: Můžete změnit chování při tažení levým tlačítkem myši do levého spodního rohu okna editoru. K dispozici jsou tři různé režimy (Box, Lasso, Paint) se čtyřmi různými charakteristikami výběru (Auto, Include Origin, Touch Box, Include Box).

source: Selection Filter
cs: Výběrový filtr

source: If you have to select many things, it can sometimes be handy to only select certain classes of objects. This is what the selection filter is for. You can open it up via the spacebar menu or by pressing :kbd:`Ctrl+i`
cs: Pokud musíte vybrat více objektů, někdy může být užitečné jen vybrat určité třídy objektů. Tomu se říká filtr výběru. Můžete jej otevřít pomocí nabídky mezerníku nebo stisknutím klávesy :kbd:`Ctrl + i`

source: Double click on an item to select only that item. Click on the check mark button on the top left to select all items.
cs: Kliknutím na políčko položky vyberete pouze tuto položku. Klikněte na zaškrtávací políčko vlevo nahoře vyberte všechny položky.

source: Next: :doc:`Moving and the interactive Manipulator<move>`
cs: Dále: :doc:`Posouvání a manipulační značka<move>`
